[
  {
    "id": 0,
    "index": 0,
    "identifier": "chkm8gsp",
    "title": "ChkM8 Admin Dashboard Web App",
    "description": "Data driven web application development for a company empowering safer human connections.",
    "link": "View Case Study",
    "background": "linear-gradient(75deg, rgba(0,0,0,1) 0%, #C260DA 100%) #301934",
    "captureMB": "4%",
    "role": "Software Engineer | Brand Strategist",
    "location": "Remote",
    "tools": ["Angular", "TypeScript", "Node.js", "Java", "Docker", "SassCSS", "MySQL", "Python", "Bash", "Git", "Figma"],
    "website": {"Admin Dashboard Prototype": "https://www.figma.com/proto/S5IRv3yLpvZWwWOQxmbos2/ChkM8_Admin_Dashboard_Groups?node-id=1-2&t=3iEDB9wtAhK0i3KC-1", "Product Walkthrough Video": "https://youtu.be/V_0P3hbTmLs", "ChkM8 Website": "https://www.chkm8.app"},
    "challenge": "Over the course of several contracts, ChkM8 asked me to work as a part of their engineering team and aid in the branding of their app. ChkM8 is a social app designed to empower users when meeting people offline. The goal of the app is to provide a platform where users can give feedback on their interactions with others, creating a safer environment for all. As part of my work for ChkM8, I was tasked with extending their Admin Dashboard web app's capabilities to allow admin tracking of user group performance. This project required a deep understanding of the app's backend and the ability to create a user-friendly interface for the admin team.",
    "solution": "Leveraging the project's existant docker-containerized Java Spring and MySQL backend and Angular and SassCSS frontend, I was able to extend the web app's reporting capabilities. The group reporting remodel involved creating a tabbed display offering three different reporting views: a weekly report showing statistics related to goal completion for the given user group, a monthly report showing group scoring performance over the last calendar month, and a group members chart showing user details for the group as a whole. I started the project with a detailed Figma prototype, proposing the end product to the ChkM8 team and followed up with a full implementation of the design. When developing the app, I found a deficit in backend migration files and developer support. As a result, I took my time to create a mysql database porting tool (using Python and Bash scripting), bypassing database permission requirements and using log parsing to scrape, format, and insert test data into a new development database. This tool was used to create a new database for the project and was later used to port the database to the production server.",
    "choices": "Many of the choices typically offered for project development were not existent in this specific project, as I was tasked with extending an already existant web app. However, I was able to make choices in the design and implementation of the new features. For example, I chose to provide a design which offered clearly defined reporting views and metrics, each with specific purposes to target the ChkM8's program goals. In addition to the design choices made, I made the choice to create a database porting tool to facilitate the project's development and deployment. This tool was a significant time saver and allowed me to focus on the project's core features while also providing real data to manipulate and test the product.",
    "result": "This project gave me the opportunity to test my knowledge of production grade products and operate on a new product blindly, with little background knowledge provided on how the product was orchestrated. The product itself was a success, offering the client with their requested features and making an social impact through ChkM8's mission. The below images show the product's outcome, but only goes halfway to seeing social change. I hope to see the product in action and see the impact it has on the world."
  },
  {
    "id": 0,
    "index": 0,
    "identifier": "chkm8",
    "title": "ChkM8 Mobile App",
    "description": "Strategic brand redesign for an app curated to empower safer human connections.",
    "link": "View Case Study",
    "background": "linear-gradient(75deg, rgba(19,53,69,1) 0%, rgba(0,0,0,1) 100%) #133545",
    "captureMB": "0",
    "role": "Software Engineer | Brand Strategist",
    "location": "Remote",
    "tools": ["Figma", "Flutter", "Adobe Photoshop", "SVG", "Adobe Fonts", "Coolors"],
    "website": {"Mobile App Redesign Prototype": "", "ChkM8 Brand Assessment": "", "ChkM8 Website": "https://www.chkm8.app"},
    "challenge": "Over the course of several contracts, ChkM8 asked me to work as a part of their engineering team and aid in the branding of their app. ChkM8 is a social app designed to empower users when meeting people offline. The goal of the app is to provide a platform where users can give feedback on their interactions with others, creating a safer environment for all. Although my main goal in working with ChkM8 was to provide engineering services, my underlying goal was to help further ChkM8's mission for social justice by providing brand feedback and solutions. One of the ways in which I demonstrated this was by providing a rebrand analysis for the app, offering suggestions for a more cohesive and user-friendly design.",
    "solution": "The ChkM8 app, as it currently stood, was unengaging and only provided one feature - the ability to schedule meetings with another user and rate the user afterwards. With the concept of rating other humans on a numerical scale being such a sensitive topic, I felt that the app needed a more engaging and user-friendly design. To address this, I created a new brand identity for the app, focusing on a more modern and engaging problem - the Millenial and Gen-Z generation's desire to move offline to meet dating and social needs. In a 39 page brand assessment, I broke down the company's current strategy, target market, and provided new market research, which indicated that over 80% of surveyed Millenials would like to find love offline, but 75% of a demographically similar sample claimed to feel 'digitally trapped'. The 39 page document provided a new brand strategy, logo, color scheme, and font choices for the app, pivoting around the concept of a 'Dating/Social App Designed for Real Life'. This proposal was followed up with a fully designed Figma prototype, which I presented to the ChkM8 team.",
    "choices": "The decision to undertake this project was of my own design. I wanted to show ChkM8 a gesture of my firm belief in their mission to make the world a safer place and offer them a renovated project. The outcome was a product which I am more than proud of. The full span of the marketing content shown in this portfolio entry, the accompanying brand assessment, and the prototype are all of my design. The choices made in the renovated brand reflect my view of Millenial and Gen-Z values based on my experience as a member of the target demographic and statistics to back up the notion. If the company were to take my suggestions into account, I believe that they would be able to better capture their target audience and make a larger impact on the world.",
    "result": "The resulting app takes ChkM8's current meeting scheduling and scoring features and puts them the centerpiece of an app designed to empower users rather than threaten them with numerical values. The new interface offers a chance for users to express themselves with a profile and bio without making introduction superficial. The new brand identity takes on a similar format as current dating apps, but is designed to take the user offline and into the real world, where they can be assured by digital safety features. The below images show the product's outcome, but only goes halfway to seeing social change. I hope to see the product in action and see the impact it has on the world."
  },
  {
    "id": 0,
    "index": 0,
    "identifier": "hispanichackers",
    "title": "Hispanic Hackers",
    "description": "Leading and designing content for a non-profit dedicated to elevating the Latino tech community.",
    "link": "View Case Study",
    "background": "#287E7F",
    "captureMB": "0",
    "role": "President | Software Engineer",
    "location": "Austin, Texas",
    "tools": ["Leadership", "Next.js", "React", "TailwindCSS", "HTML", "CSS", "JavaScript", "MongoDB", "Git", "Figma", "Adobe Photoshop", "Hispanic Hackers", "Techqueria"],
    "website": "https://www.hispanichackers.com",
    "challenge": "According to the US Census Bureau, people of Latino or Hispanic ethnicity make up 19.1% of the United States population. However, 1 out of every 6 of the Hispanic-identifying citizens live under the poverty line and Latinos make up only 8% of the tech workforce (Pew Research Center). With such a large disparity between Latinos and the promising US tech industry, the Hispanic population is in need of resources, community, and opportunities for advancement.",
    "solution": "Elevating the Latino community in tech is where Hispanic Hackers shines. I am the president of the 2400 member 501(c)(3) non-profit which offers events, resources, and community to Latinos/Hispanics in the tech industry. As the president, I inherited an 8-year old group and turned it into a federally recognized organization. We are constantly forming new partnerships, providing a safe space for Latino voices, and creating new resources for our community. To support the organization, I am leading a team of developers, designers, and leaders to build our portfolio for change.",
    "choices": "Hispanic Hackers is the central resource for Latino tech in Austin and beyond. As such, we are partnered with mutliple local and global organizations to provide representation and opportunities to our community. In terms of media and branding, I have led the efforts to market Hispanic Hackers to a wider audience, providing community for developers, entrepreneurs, and all Latino innovators. We have upgraded our website to a Next.js website with Tailwind CSS and React components. To store user data and subscribers to our monthly newsletter, we have configured and connected a MongoDB database to our site. As we continue to grow, we hope to be able to provide a wider range of online resources including a member database, business information, and connections to our partnering organizations.",
    "result": "As we continue to grow, we find more and more resources to provide to our community and are planning to expand with new initiatives for Latinos in the United States and LATAM. More information on our upcoming events can be found at the website given above. The below images are website designs I created that are a work in progress for revitalizing our online presence. Because my time is stretched thin, I am bringing on other developers and designers to enhance the appearance and growth of Hispanic Hackers. As a leader, I hope to elevate the Latino tech community to new heights."
  },
  {
    "id": 0,
    "index": 0,
    "identifier": "modern-cec",
    "title": "Defense Software Modernization",
    "description": "Modernizing the United States Navy’s tactical weapon’s system.",
    "link": "View Case Study",
    "background": "url('/images/featured/modern-cec/bg.webp') #1a202c",
    "captureMB": "0",
    "role": "Software Engineer",
    "location": "Austin, Texas",
    "tools": ["C / C++", "Go", "JavaScript", "Docker", "Prometheus", "Grafana", "RTI DDS", "Git", "Linux", "Draw.io"],
    "website": "",
    "premise-removed": "Note: To comply with Fathom5's Non-Disclosure Agreement, only information which is publicly available or common practice has been given in this report.\n\nFathom5 is a US Navy contracting company with an afinity for creating cyber-first software solutions. As a Fathom5 software engineer, I had the pleasure of working on the CEC Next team of two dedicated software engineers.",
    "challenge": "This project had the goal of modernizing the US Navy's Cooperative Engagement Capability (CEC) system. As shown in the figure to the left, CEC is a system crucial to tactical tracking and engagement by collecting, aggregating, and controlling both local and networked data on warships, jets, and sensors. For example, by aggregating entity position data from different sources and vantage points, a strategically placed asset is able to better address an adversary entity. Although a powerful mechanism, the software responsible for CEC data aggregation was programmed in the 1990s and is due for an update.",
    "solution": "To demonstrate modernization capability of the CEC system, myself and a colleague applied containerization techniques to a program representing the current CEC software. This process converted the C++ program monolith into a set of microservices with telemetry capabilities. To simulate data into the program, we programmed a Golang simulator with the capabilities of recording and outputting data over a network. In our application, telemetry is collected by a Golang service and aggregated in a Prometheus database. The image to the right represents the program's custom UI, taking aggregated telemetry at different endpoints and displaying with Grafana.",
    "choices": "Containerized with Docker and orchestrated with Kubernetes, the C++ and Golang microservices communicate over an internal network using the RTI DDS publisher/subscriber messaging service by Real-Time Innovations. Telemetry collected through an external Golang microservice is aggregated by Prometheus and displayed on a Grafana dashboard. Machine processing metrics are collected using Node Exporter, providing CPU and Memory usage. The Grafana dashboard is edited using a JavaScript plugin to produce custom graphics.",
    "result": "The US Navy was impressed with the project outcome, which simulated data, sent it to a containerized parser, and interfaced state data between a set of threaded functions. Data throughput was recorded and compared for both the monolithic and microservice versions of the program using the Telemetry engine. This verified the performance of a modernized system to the customer."
  },
  {
    "id": 0,
    "index": 0,
    "identifier": "ev-systems",
    "title": "EV Systems Architecture",
    "description": "Designing R&D circuits and firmware for the next generation of electric vehicles.",
    "link": "View Case Study",
    "background": "url('/images/featured/ev-systems/bg.webp') #923830",
    "captureMB": "25px",
    "role": "Embedded Systems Engineer",
    "location": "Austin, Texas",
    "tools": ["KiCad", "Beagle Board", "Arduino", "Linux", "C / C++", "Python", "Node.js", "JavaScript", "Texas Instruments", "Nordic", "Solidworks", "Draw.io", "Adafruit", "Git"],
    "website": "",
    "challenge": "The electric vehicle industry is a fast evolving one. As the industry continues to grow, I have had the pleasure of completing several projects in electric vehicle embedded systems technology, combining both firmware and electrical design. Two of these projects related to distinct yet interconnected domains: the design of an innovative electrical circuit and firmware for a motorcycle with a mechanically modernized transmission system, and the creation of a rover capable of performing repetitive tasks in various repeat process environments. Both projects required cutting-edge solutions that would set new standards in efficiency, performance, and adaptability.",
    "solution": "Solutions for these projects involved a holistic approach that seamlessly integrated various technologies. For the motorcycle, a state-of-the-art EV Systems Architecture was designed, optimized for telemetry and efficiency, and integrated with the modern transmission system. The rover required a modular and scalable embedded system, equipped with advanced algorithms to enable autonomous learning and task optimization. The image to the left shows the mechatronics processes for the Repeat Rover project.",
    "choices": "Both projects involved coinciding sets of technology such as the KiCAD electric design suite, Solidworks for modeling custom mechanical components, and C++ as the basic language for providing microcontroller instructions. While the motorcycle project used prototyping controllers such as Arduino and Beagle Bone, the rover project was controlled by a Nordic nRF52 chip with custom firmware mounted on a custom PCB. The motorcycle interfaced with custom hardware to interact with the CANBUS, read real-time wheel speed data from the ABS system, and assert motor shifting with asynchronous motors. The rover, on the other hand, used a custom set of reluctors and hall effect sensors, an accelerometer, and bluetooth to recieve and compute instructions. Realtime telemetry and testing UI were programmed with Node.js and JavaScript for both projects.",
    "result": "The combined result of both projects demonstrated an advancement in both the automotive and robotics industries. The data collected from the motorcycle with a modernized transmission system proved significant growth in the future of the EV industry, setting new standards in performance. Simultaneously, the rover's intelligent design enabled it to function in repeat process environments, showcasing the potential for further innovation in automation and robotics."
  },
  {
    "id": 0,
    "index": 0,
    "identifier": "alpenaerial",
    "title": "Alpen Aerial",
    "description": "Building website & brand content for a startup which takes drone footage to new heights.",
    "link": "View Case Study",
    "background": "#CE7829",
    "captureMB": "0",
    "role": "Frontend Engineer",
    "location": "Colorado Springs, Colorado",
    "tools": ["HTML", "CSS", "JavaScript", "jQuery", "Python", "Git", "Wix", "Adobe Photoshop", "Final Cut Pro"],
    "website": "https://www.alpenaerial.com",
    "challenge": "Alpen Aerial specializes in converting panoramic drone footage into interactive online tours. However, the company lacked a cohesive online presence to showcase its capabilities. The challenge was to create a website and brand content that would not only reflect the startup's cutting-edge technology but also engage users and potential clients. The project required a blend of aesthetic appeal, functionality, and a clear representation of the brand's unique value proposition",
    "solution": "Solving Alpen Aerial's branding needs involved a comprehensive approach to building a website that would serve as the startup's digital storefront. This included creating a visually appealing design that resonated with the brand's active and innovative spirit, developing interactive features to showcase the panoramic tours, and crafting compelling content that communicated the startup's mission and services. Collaboration with the startup's team ensured alignment with their vision and goals.",
    "choices": "This project involved a mix of web programming with WebGen, Python, and JavaScript as well as Wix and Wix Velo development. In addition to producing website content for the company, I programmed embedded webpages for client panoramic tours. In order to produce effective tours for diverse industries, I worked closely with clients and highlighted the parts of their projects which were of greatest value to their goals. Alpen Aerial is an active and exciting company with a mission to capture the extremes of the world and human capability. My branding strategy emulated the company's tenactiy to create innovatively beautiful products.",
    "result": "The resulting website and brand content successfully encapsulated the startup's innovative approach to panoramic drone footage and interactive online tours. The sleek design, engaging user experience, and compelling content worked to display Alpen Aerial's daring potential. The startup's online presence was transformed into a powerful tool that not only showcased their unique offerings but also positioned them with capability in the field."
  }
]
